7.4_eventbrite_clone_step4/app/controllers/attendances_controller.rb

  def create
    # Amount in cents
    @event = Event.find(params[:event_id])

    @amount = @event.price * 100

    customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
    })

    charge = Stripe::Charge.create({
      customer: customer.id,
      amount: @amount,
      description: "Inscription à #{@event.title}",
      currency: 'eur',
    })


    @guest = Attendance.create(stripe_customer_id: customer.id, user_id: current_user.id, event_id: @event.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_GloyxYXEHhvgnN"], ["user_id", 3], ["event_id", 1], ["created_at", "2020-02-20 15:52:36.742601"], ["updated_at", "2020-02-20 15:52:36.742601"]]