7.4_eventbrite_clone_step4/app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @admin = User.find(@event.admin_id)

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "updated_at" = $1 WHERE "events"."id" = $2  [["updated_at", "2020-02-21 11:46:44.005816"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)