7.4_eventbrite_clone_step4/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    redirect_to :root
    @users = User.all

UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-02-21 12:08:23.616444"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)