7.4_eventbrite_clone_step4/app/views/users/show.html.erb


<% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"