7.2_eventbrite_clone_step2/app/controllers/users_controller.rb

  def index
    redirect_to :root
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "description" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["description", ""], ["first_name", "Luca"], ["last_name", "Montaigut"], ["updated_at", "2020-02-18 15:29:38.557798"], ["id", 5]]