7.2_eventbrite_clone_step2/app/views/users/show.html.erb

SELECT "events".* FROM "events"
---

<% Event.all.each do |event| %>