7.3_eventbrite_clone_step3/app/controllers/events_controller.rb

  def show
    @admin = User.find(@event.admin_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "start_date" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["start_date", "2020-03-02 20:21:00"], ["updated_at", "2020-02-18 20:30:38.131131"], ["id", 7]]