7.3_eventbrite_clone_step3/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    redirect_to :root
    @users = User.all

UPDATE "users" SET "description" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["description", ""], ["first_name", "Luca"], ["last_name", "Montaigut"], ["updated_at", "2020-02-18 15:29:38.557798"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)