7.3_eventbrite_clone_step3/app/views/users/show.html.erb

SELECT "events".* FROM "events"
---

<% Event.all.each do |event| %>